output/posts/foss-talks-at-cdeep.org
#+BEGIN_COMMENT
.. title: FOSS talks at CDEEP
.. date: 2009/07/10 23:08:00
.. tags: ology
.. slug: foss-talks-at-cdeep
#+END_COMMENT




I had the opportunity to attend a FOSS talk session organized by
Center for Distance Education Engineering Programme (CDEEP) as a
part of the National Mission on Education through ICT. The
National Mission on Education through ICT has some lofty goals,
which when reached will take the country ahead by leaps and
bounds.

The Mission has a budget of $1billion in the 11th Five year plan,
40% of which will be spent on content generation (all of which
will be free/open source) and the rest will be spent on making
available a minimum bandwidth of 1Gbps to the 30,000 odd colleges
spread over India (out of which around 3000 are Engineering
colleges). The mission has various projects planned and they are
picking up steam rapidly. The project I will be working on, for
the Adoption of Open Source in Engineering and Science Education
in India, is also a part of this Mission. Prof. Kannan had kick
started the session with an introduction to the National Mission
on Education through ICT. The talks were all being webcast to
various EduSAT centers and on the web.

Then, Prof. Pathak talked on, why open source is important. He
said, (not exactly quoting him) " It is theoritically possible for
any person to learn and discover things from scratch, but there's
been only one Ekalavya in the entire history of India." Education
is a social activity and hence open access to content is
absolutely vital. He mentioned various things like how IIT-B has
been working on Creative Commons licensing and other things going
on here. He ended the talk with a hope that soon India will move
from being a net taker of Open source to a net giver to open
source.

This was followed by three talks, delivered by developers from
RedHat meant for programmers who wish to contribute to FLOSS.

The first talk was by Ramakrishna Reddy, titled 10 things a FLOSS
developer should know. It was a pretty nice and balanced talk,
covering a wide range of things. I would like to point out a few
things, that I liked the most.

- He clarified the term hacker as soon as he used it.
- He emphasized a lot on groking code; reading code for fun,
  looking at the code of others, reading as much code as
  possible...
- He talked of muscle memory of emacsen. I liked the way he talked
  of people being so quick with their editors and how learning to
  use your tools effectively is a big plus
- Release often, Release early. Everybody talks of it, but he said
  a few words, which I liked. Some developers don't usually
  release their code as early for the fear of being ridiculed. But
  don't bother, "we are just small people, in the whole galaxy."

The next talk was by Prasad Pandit on How to use Infrastructure
for FOSS projects. Prasad talked of Website, Version Control,
Mailing list, IRC, Bugzilla, Wiki and RSS feeds. He gave quite a
few examples on how each thing is important, most of the examples
being his personal experiences.

The last talk was by Rahul Sundaram and was on Communication in a
FOSS project. For a change he didn't have slides and the reason
for that, he said, is that communication in a FOSS project is
casual and not having slides and walking in with a t-shirt and
jeans represents that casualness which is a culture of FOSS
projects' communication.

- Be polite, but don't be Formal.
- Be precise, but do provide a context to what you are saying.
- Don't fear that you'll say something foolish, which, will be
  archived for eternity. Mistakes are there to learn from. Not
  just you, but others too.

He talked of quite a lot of things, but these were the things
which struck me as particularly interesting/important.

At the end, all the participants walked out with Fedora 11 DVDs
from the RedHat/Fedora guys. :D
