output/posts/foss-talks-at-cdeep.html
<!DOCTYPE html><html lang="en">
<head>
    
    <meta charset="utf-8">
    <meta name="description" content="">
    <meta name="author" content="punchagan">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>FOSS talks at CDEEP | Noetic Nought</title>
    
            <link href="/assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
    <!--[if lt IE 9]>
    <![endif]-->
            <link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">

    



    
</head>

<body>
    <section class="social">
        <ul>
        
            <li><a href="/index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="/archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="/categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="/rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/punchagan" title="Twitter profile"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/punchagan" title="GitHub profile"><i class="icon-github"></i></a></li>

        </ul>
    </section>
    <section class="page-content">
        <div class="content" rel="main">
            
    <div class="post">
    
    <h1 class="p-name" itemprop="headline name">FOSS talks at CDEEP</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2009-07-10T23:08:00+05:30">2009-07-10 23:08</time>
            </div>
            

            
          |  
        <a href="/posts/foss-talks-at-cdeep.org" id="sourcelink">Source</a>

            
    <div class="tags">
        <ul>
        More posts about:  
            <li><a class="tag" href="/categories/ology.html">ology</a></li>
        </ul>
    </div>

        </div>
        <div class="body">
            <p>
I had the opportunity to attend a FOSS talk session organized by
Center for Distance Education Engineering Programme (CDEEP) as a
part of the National Mission on Education through ICT. The
National Mission on Education through ICT has some lofty goals,
which when reached will take the country ahead by leaps and
bounds.
</p>

<p>
The Mission has a budget of $1billion in the 11th Five year plan,
40% of which will be spent on content generation (all of which
will be free/open source) and the rest will be spent on making
available a minimum bandwidth of 1Gbps to the 30,000 odd colleges
spread over India (out of which around 3000 are Engineering
colleges). The mission has various projects planned and they are
picking up steam rapidly. The project I will be working on, for
the Adoption of Open Source in Engineering and Science Education
in India, is also a part of this Mission. Prof. Kannan had kick
started the session with an introduction to the National Mission
on Education through ICT. The talks were all being webcast to
various EduSAT centers and on the web.
</p>

<p>
Then, Prof. Pathak talked on, why open source is important. He
said, (not exactly quoting him) " It is theoritically possible for
any person to learn and discover things from scratch, but there's
been only one Ekalavya in the entire history of India." Education
is a social activity and hence open access to content is
absolutely vital. He mentioned various things like how IIT-B has
been working on Creative Commons licensing and other things going
on here. He ended the talk with a hope that soon India will move
from being a net taker of Open source to a net giver to open
source.
</p>

<p>
This was followed by three talks, delivered by developers from
RedHat meant for programmers who wish to contribute to FLOSS.
</p>

<p>
The first talk was by Ramakrishna Reddy, titled 10 things a FLOSS
developer should know. It was a pretty nice and balanced talk,
covering a wide range of things. I would like to point out a few
things, that I liked the most.
</p>

<ul class="org-ul">
<li>He clarified the term hacker as soon as he used it.
</li>
<li>He emphasized a lot on groking code; reading code for fun,
looking at the code of others, reading as much code as
possible…
</li>
<li>He talked of muscle memory of emacsen. I liked the way he talked
of people being so quick with their editors and how learning to
use your tools effectively is a big plus
</li>
<li>Release often, Release early. Everybody talks of it, but he said
a few words, which I liked. Some developers don't usually
release their code as early for the fear of being ridiculed. But
don't bother, "we are just small people, in the whole galaxy."
</li>
</ul>

<p>
The next talk was by Prasad Pandit on How to use Infrastructure
for FOSS projects. Prasad talked of Website, Version Control,
Mailing list, IRC, Bugzilla, Wiki and RSS feeds. He gave quite a
few examples on how each thing is important, most of the examples
being his personal experiences.
</p>

<p>
The last talk was by Rahul Sundaram and was on Communication in a
FOSS project. For a change he didn't have slides and the reason
for that, he said, is that communication in a FOSS project is
casual and not having slides and walking in with a t-shirt and
jeans represents that casualness which is a culture of FOSS
projects' communication.
</p>

<ul class="org-ul">
<li>Be polite, but don't be Formal.
</li>
<li>Be precise, but do provide a context to what you are saying.
</li>
<li>Don't fear that you'll say something foolish, which, will be
archived for eternity. Mistakes are there to learn from. Not
just you, but others too.
</li>
</ul>

<p>
He talked of quite a lot of things, but these were the things
which struck me as particularly interesting/important.
</p>

<p>
At the end, all the participants walked out with Fedora 11 DVDs
from the RedHat/Fedora guys. :D
</p>
        </div>
        
    <ul class="pager">
        <li class="previous">
            <a href="/posts/to-do-or-not-to-do.html" rel="prev">← Previous post</a>
        </li>
        <li class="next">
            <a href="/posts/postfix-mailman-for-multiple-domains.html" rel="next">Next post →</a>
        </li>
    </ul>

            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="rusticreverie",
            disqus_url="http://punchagan.muse-amuse.in/posts/foss-talks-at-cdeep.html",
        disqus_title="FOSS talks at CDEEP",
        disqus_identifier="cache/posts/foss-talks-at-cdeep.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

    </div>

            © 2013
<a href="mailto:punchagan%5B@T%5Dmuse-amuse.in">punchagan</a> -
<a href="http://getnikola.com">Nikola</a> powered -

<a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">
Creative Commons Attribution 3.0 Unported License</a>
 -
<a href="http://themes.getnikola.com/#zen">zen</a> theme
            
	

        </div>
    </section>
    
            <script src="/assets/js/all-nocdn.js" type="text/javascript"></script>

    
        <script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
    
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-21111013-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>

</body>
</html>